Repository: LeoGuths/guths-shared
Catalog: Guths.Shared/Localization/Resources/Global.*.resx
Languages: es_es, pt_br

# IdRequired
source: ID is required
es_es: El ID es obligatorio
pt_br: O ID é obrigatório

source: Financial entry not found
es_es: Registro financiero no encontrado
pt_br: Registro financeiro não encontrado

# FinancialEntryOperationMustBe
source: The entry operation must be either {0}, {1}, {2} or {3}.
es_es: La operación de registro debe ser {0}, {1}, {2} o {3}.
pt_br: A operação do registro deve ser {0}, {1}, {2} ou {3}.

# FinancialEntryValuePositive
source: Entry value must be positive.
es_es: El valor del registro debe ser positivo.
pt_br: O valor do registro deve ser positivo.

# NameRequired
source: Name is required
es_es: Nombre obligatorio
pt_br: O nome é obrigatório

# NameMaxCharacters
source: Name must be a maximum of 80 characters
es_es: El nombre debe tener un máximo de {0} caracteres
pt_br: O nome deve ter no máximo {0} caracteres

# TenantIdRequired
source: The Tenant ID is required.
es_es: El ID del Tenant es obligatorio.
pt_br: O ID do Tenant é obrigatório.

# EmailRequired
source: Email is required.
es_es: El correo electrónico es obligatorio.
pt_br: O email é obrigatório.

# BirthdayDateLessThanOrEqualToToday
source: The birth date cannot be greater than the current date.
es_es: La fecha de nacimiento no puede ser mayor que la fecha actual.
pt_br: A data de nascimento não pode ser maior que a data atual.

# PictureFileRequired
source: The image file is required
es_es: El archivo de imagen es obligatorio
pt_br: O arquivo de imagem é obrigatório

# PictureFileSupported
source: The image file format must be {0}
es_es: El formato del archivo de imagen debe ser {0}
pt_br: O formato arquivo de imagem deve ser {0}

# UserIdRequired
source: The User ID is required
es_es: El ID del usuario es obligatorio
pt_br: O ID do Usuário é obrigatório

source: User not found
es_es: Usuario no encontrado
pt_br: Usuário não encontrado

# UserAlreadyActive
source: User is already active
es_es: El usuario ya está activado
pt_br: Usuário já está ativado

# UserAlreadyDeactivated
source: User is already deactivated
es_es: El usuario ya está desactivado
pt_br: Usuário já está desativado

source: Petrol
es_es: Gasolina
pt_br: Gasolina

source: Ethanol
es_es: Etanol
pt_br: Etanol

# PetrolGreaterThanZero
source: The price of Petrol must be greater than zero.
es_es: El precio de la Gasolina debe ser mayor que cero.
pt_br: O preço da Gasolina deve ser maior que zero.

# EthanolGreaterThanZero
source: The price of Ethanol must be greater than zero.
es_es: El precio del Etanol debe ser mayor que cero.
pt_br: O preço do Etanol deve ser maior que zero.

# CustomEfficiencyGreaterThanZero
source: The Custom Efficiency must be greater than zero.
es_es: La Eficiencia Personalizada debe ser mayor que cero.
pt_br: A Eficiência Personalizada deve ser maior que zero.

# MostAdvantageousFuel
source: Based on the efficiency of {0}, {1} is more advantageous because the equivalent price is {2}.
es_es: Basándose en la eficiencia de {0}, {1} es más ventajoso porque el precio equivalente es {2}.
pt_br: Com base na eficiência de {0}, o {1} é mais vantajoso, pois o preço equivalente é {2}.

# ReceiptFileRequired
source: The receipt file is required
es_es: El archivo del recibo es obligatorio
pt_br: O arquivo de recibo é obrigatório

# ReceiptFileSupported
source: The receipt file format must be {0}
es_es: El formato del archivo del recibo debe ser {0}
pt_br: O formato arquivo de recibo deve ser {0}

source: Payment receipt not found
es_es: Recibo de pago no encontrado
pt_br: Recibo de pagamento não encontrado

# StartDayOfMonthBetween
source: The first day of the month must be between 1 and 28.
es_es: El primer día del mes debe estar entre 1 y 28.
pt_br: O primeiro dia do mês deve estar entre 1 e 28.

# SpendingAreaRequired
source: Spending area is required for this type of entry.
es_es: El área de gasto es obligatoria para este tipo de registro.
pt_br: O área de gasto é obrigatória para esse tipo de registro.

# SpendingPurposeRequired
source: Spending purpose is required for this type of entry.
es_es: El propósito del gasto es obligatorio para este tipo de registro.
pt_br: A finalidade do gasto é obrigatória para esse tipo de registro.

# PaymentStatusNotAllowed
source: Payment status must not be set for entries of type Income or Credit Card Expense.
es_es: El estado de pago no debe completarse para entradas de tipo Ingreso o Gasto con tarjeta.
pt_br: O status de pagamento não deve ser preenchido para entradas do tipo Receita ou Despesa no Cartão.

source: User settings not found.
es_es: No se encontraron las configuraciones del usuario.
pt_br: As configurações do usuário não foram encontradas.

# SpendingAreaMustBeEmptyWhenIncome
source: The 'Spending Area' field must not be provided for incomes.
es_es: El campo 'Área del gasto' no debe estar presente para ingresos.
pt_br: O campo 'Área do gasto' não deve ser informado para receitas.

# SpendingPurposeMustBeEmptyWhenIncome
source: The 'Spending Purpose' field must not be provided for incomes.
es_es: El campo 'Finalidad del gasto' no debe estar presente para ingresos.
pt_br: O campo 'Finalidade do gasto' não deve ser informado para receitas.

# EmailAlreadyRegistered
source: Email is already registered.
es_es: Correo electrónico ya registrado.
pt_br: Email já registrado.

# CellphoneAlreadyRegistered
source: Cellphone is already registered.
es_es: Teléfono móvil ya registrado.
pt_br: Celular já registrado.

# UserAlreadyConfirmed
source: User is already confirmed.
es_es: El usuario ya está confirmado.
pt_br: Usuário já está confirmado.

# VerificationCodeRequired
source: Verification code is required.
es_es: Se requiere código de verificación.
pt_br: Código de verificação é obrigatório.

source: Invalid or expired verification code.
es_es: Código de verificación inválido o expirado.
pt_br: Código de verificação inválido ou expirado.

# VerificationCodeAlreadyUsed
source: Verification code has already been used.
es_es: Código de verificación ya utilizado.
pt_br: Código de verificação já utilizado.

# UserIsDeactivated
source: This user is deactivated.
es_es: Este usuario está desactivado.
pt_br: Esse usuário está desativado.

# RefreshTokenRequired
source: The RefreshToken must not be null or empty.
es_es: El RefreshToken no puede ser nulo ni estar vacío.
pt_br: O RefreshToken não pode ser nulo ou vazio.

# FinancialEntryIdIsRequired
source: The Financial Entry ID is required.
es_es: El ID del Registro Financiero es obligatorio.
pt_br: O ID do Registro Financeiro é obrigatório.

# PageNumberMustBeGreaterThanZero
source: The page number must be greater than zero.
es_es: El número de página debe ser mayor que cero.
pt_br: O número da página deve ser maior que zero.

# PageSizeMustBeBetween
source: The page size must be between {0} and {1}.
es_es: El tamaño de página debe estar entre {0} y {1}.
pt_br: O tamanho da página deve estar entre {0} e {1}.

# FileTooLarge
source: The file is too large.
es_es: El archivo es demasiado grande.
pt_br: O arquivo é muito grande.

# FileIsEmpty
source: The file is empty.
es_es: El archivo está vacío.
pt_br: O arquivo está vazio.

# FileNameTooLong
source: The file name is too long.
es_es: El nombre del archivo es demasiado largo.
pt_br: O nome do arquivo é muito longo.

# FileNameContainsInvalidCharacters
source: The file name contains invalid characters.
es_es: El nombre del archivo contiene caracteres no válidos.
pt_br: O nome do arquivo contém caracteres inválidos.

# TimeZoneIdRequired
source: Time Zone ID is required.
es_es: El ID de zona horaria es obligatorio.
pt_br: Id do Time Zone é obrigatório.

# MonthOutOfRange
source: Month must be between 1 and 12.
es_es: El mes debe estar entre 1 y 12.
pt_br: Mês deve estar entre 1 e 12.

# YearCannotBeInFuture
source: Year cannot be greater than the current year.
es_es: El año no puede ser mayor que el año actual.
pt_br: Ano não pode ser maior do que o ano atual.

# MonthYearCannotBeInFuture
source: Month and year cannot be greater than the current month and year.
es_es: El mes y el año no pueden ser mayores que el mes y el año actuales.
pt_br: Mês e ano não podem ser maiores do que o mês e ano atual.

source: File not found.
es_es: Archivo no encontrado.
pt_br: Arquivo não encontrado.

source: Month is required.
es_es: El mes es obligatorio.
pt_br: Mês é obrigatório

source: Year is required.
es_es: El año es obligatorio.
pt_br: Ano é obrigatório

# EmailToIsRequired
source: The recipient is required.
es_es: El destinatario es obligatorio.
pt_br: O destinatário é obrigatório.

# EmailSubjectIsRequired
source: The subject is required.
es_es: El asunto es obligatorio.
pt_br: O assunto é obrigatório.

# EmailHtmlBodyIsRequired
source: The email body is required.
es_es: El cuerpo del correo electrónico es obligatorio.
pt_br: O corpo do e-mail é obrigatório.
